{
  "welcome": "¡Bienvenido a Student Assistant!",
  "empower": "¡Potencia tu viaje de codificación hoy!",
  "unlock": "Desbloquea el lenguaje del futuro",
  "codingSkill": "La codificación es una habilidad esencial en el mundo digital de hoy. En Student Assistant, estamos aquí para hacer que la codificación sea accesible para todos, adaptada para ajustarse a tu estilo y ritmo de aprendizaje personal.",
  "offer": "Lo que ofrecemos",
  "personalizedLearning": "Guías de Aprendizaje Personalizadas: Comienza desde cero o mejora tus habilidades a través de guías y lecciones de programación personalizadas.",
  "adaptiveLearning": "Tecnologías de Aprendizaje Adaptativas: Nuestra plataforma inteligente ajusta el nivel de desafío basado en tus interacciones, manteniéndote constantemente comprometido.",
  "multilingualSupport": "Soporte Multilingüe: Aprende en el idioma con el que te sientas más cómodo, gracias a nuestro extenso soporte lingüístico.",
  "collaborativeChat": "Chat Colaborativo: Aborda problemas del mundo real con compañeros para ganar experiencia práctica y fomentar el aprendizaje comunitario.",
  "gamifiedExperience": "Experiencia Gamificada: Haz que aprender sea divertido con desafíos gamificados que te motivan y recompensan por tu progreso y creatividad.",
  "continuousFeedback": "Bucle de Retroalimentación Continua: Evolucionamos con tus comentarios, adaptándonos continuamente para satisfacer mejor tus necesidades educativas.",
  "whyChooseUs": "¿Por qué elegirnos?",
  "chooseUsDescription": "En Student Assistant, eres más que un aprendiz; eres parte de una comunidad global. Únete a nosotros en nuestra misión de democratizar la educación en codificación, haciéndola atractiva, efectiva y disfrutable para todos.",
  "aboutStudentAssistant": "Acerca de Student Assistant",
  "empoweringYourCodingJourney": "Potenciando tu viaje de codificación",
  "ourMission": "Nuestra misión",
  "ourMissionDescription": "En Student Assistant, estamos dedicados a transformar cómo los nuevos programadores aprenden e interactúan con los lenguajes de programación. Fundado por un estudiante motivado de la Universidad de Solent, nuestro objetivo es hacer que la codificación sea más accesible, comprensible y atractiva para todos, especialmente para los principiantes. Nuestra plataforma se basa en la creencia de que la codificación no debe ser intimidante, sino una habilidad accesible y disfrutable.",
  "theChallenge": "El Desafío",
  "theChallengeDescription": "Aprender a programar puede ser desalentador. Muchos estudiantes luchan con cursos tradicionales de talla única que no se adaptan a diferentes velocidades o estilos de aprendizaje. Esta brecha puede llevar a la frustración y desmotivación, haciendo difícil para los principiantes progresar en el aprendizaje de esta habilidad vital.",
  "ourSolution": "Nuestra Solución",
  "ourSolutionDescription": "Student Assistant está a punto de lanzarse en un futuro cercano con un conjunto de características diseñadas para abordar estos desafíos:",
  "personalizedLearningGuides": "Guías de Aprendizaje Personalizadas: Desafíos y proyectos de programación adaptados a tu nivel de habilidad y estilo de aprendizaje.",
  "adaptiveLearningTechnologies": "Tecnologías de Aprendizaje Adaptativas: Nuestra plataforma utiliza datos en tiempo real para ajustar la dificultad y el tipo de desafíos de codificación para adaptarse a tu curva de aprendizaje.",
  "interactiveAndEngagingContent": "Contenido Interactivo y Atractivo: A través de la gamificación y modelos de aprendizaje interactivos, te mantenemos comprometido y motivado.",
  "supportiveCommunity": "Comunidad de Apoyo: Un enfoque impulsado por la comunidad donde los aprendices pueden interactuar, compartir y crecer juntos.",
  "visionForTheFuture": "Visión para el Futuro",
  "visionForTheFutureDescription": "Aspiramos a democratizar la educación en codificación a nivel mundial, asegurando que cualquiera interesado en aprender a programar tenga las herramientas y el apoyo que necesita para tener éxito. Con un enfoque en la mejora continua y los comentarios de los usuarios, Student Assistant evolucionará para satisfacer las diversas necesidades de los aprendices en todo el mundo.",
  "joinUs": "Únete a nosotros para dar forma al futuro de la educación en codificación",
  "joinUsDescription": "Mientras nos preparamos para nuestro próximo lanzamiento, te invitamos a ser parte de nuestra comunidad. Ya seas un estudiante potencial, un educador o un entusiasta de la tecnología, tu aporte puede ayudar a dar forma al mejor entorno de aprendizaje posible.",
  "challenge1": "Desafío 1",
  "helloWorld": "¡Hola, Mundo!",
  "helloWorldDescription": "Escribe un programa que imprima \"¡Hola, Mundo!\" en la pantalla.",
  "clickReveal": "Haz clic en el botón de abajo para revelar el fragmento de código.",
  "reveal": "Revelar",
  "challenge2": "Desafío 2",
  "simpleCalculator": "Calculadora Simple",
  "simpleCalculatorDescription": "Crea un programa que tome dos números como entrada y permita al usuario realizar operaciones aritméticas básicas como suma, resta, multiplicación y división.",
  "challenge3": "Desafío 3",
  "fizzBuzz": "FizzBuzz",
  "fizzBuzzDescription": "Escribe un programa que imprima los números del 1 al 100. Para múltiplos de tres, imprime \"Fizz\" en lugar del número, y para múltiplos de cinco, imprime \"Buzz\". Para los números que son múltiplos de ambos, tres y cinco, imprime \"FizzBuzz\".",
  "sendButton": "Enviar",
  "contactUs": "Contáctanos",
  "contactUsDescription": "¡Estamos aquí para ayudar! Conéctate con Student Assistant para cualquier pregunta o soporte.",
  "emailUs": "Envíanos un correo electrónico",
  "generalInquiries": "Consultas generales: info@studentassistant.com",
  "support": "Soporte: support@studentassistant.com",
  "feedback": "Comentarios: feedback@studentassistant.com",
  "callUs": "Llámanos",
  "phone": "Teléfono: +1 234 567 8900",
  "followUs": "Síguenos",
  "followUsDescription": "Mantente actualizado siguiendo nuestras redes sociales:",
  "facebook": "Facebook: StudentAssistantFB",
  "twitter": "Twitter: @StudentAssist",
  "linkedin": "LinkedIn: Student-Assistant",
  "mailingAddress": "Dirección Postal",
  "address1": "Student Assistant",
  "address2": "123 Coding Ave, Suite 100",
  "address3": "Ciudad Tecnológica, TE 12345",
  "valueFeedback": "Valoramos tus comentarios",
  "valueFeedbackDescription": "Tus percepciones nos ayudan a mejorar y personalizar nuestra plataforma para satisfacer mejor tus necesidades. Por favor, comparte tus pensamientos sobre cómo podemos mejorar Student Assistant.",
  "shareFeedback": "Comparte tus comentarios",
  "shareFeedbackDescription": "Apreciamos tu tiempo y esfuerzo en ayudarnos a hacer de Student Assistant el mejor recurso para aprender a codificar. Tus comentarios son cruciales para nosotros para entender qué funciona bien y qué se puede mejorar.",
  "surveyDescription": "Por favor, toma unos minutos para completar nuestra encuesta de comentarios haciendo clic en el enlace de abajo:",
  "surveyLink": "URL_TO_SURVEY",
  "surveyLinkText": "Realiza la encuesta de comentarios",
  "surveyAspects": "Esta encuesta te preguntará sobre varios aspectos de nuestra plataforma, incluyendo:",
  "surveyAspectsList": [
    "Facilidad de uso",
    "Calidad del contenido",
    "Personalización de los caminos de aprendizaje",
    "Interacción con la comunidad y soporte",
    "Satisfacción general"
  ],
  "whyFeedback": "Por qué tus comentarios son importantes",
  "whyFeedbackDescription": "Tus comentarios influyen directamente en el desarrollo y mejora de nuestros servicios. Nos ayudan a:",
  "whyFeedbackList": [
    "Identificar áreas que necesitan mejora",
    "Entender las necesidades de los usuarios más ampliamente",
    "Crear un entorno de aprendizaje más atractivo y efectivo"
  ],
  "thankYou": "Gracias",
  "thankYouDescription": "Gracias por ser parte de nuestra comunidad y por tomarte el tiempo para ayudarnos a crecer y mejorar. Estamos comprometidos a refinar continuamente nuestra plataforma para servirte mejor.",
  "header": "IDE en línea Codeboard",
  "selectLanguage": "Selecciona el idioma: &nbsp; &nbsp;",
  "runButton": "Ejecutar",
  "userRegistration": "Registro de usuario",
  "nameLabel": "Nombre:",
  "emailLabel": "Correo electrónico:",
  "passwordLabel": "Contraseña:",
  "submitButton": "Enviar",
  "gdprTitle": "Declaración de Cumplimiento de GDPR",
  "gdprIntro": "Student Assistant está comprometido a asegurar la protección de los datos personales y la privacidad de nuestros usuarios. Nos adherimos estrictamente a las directrices establecidas por el Reglamento General de Protección de Datos (GDPR), efectivo desde el 25 de mayo de 2018.",
  "dataCollectionTitle": "1. Datos personales que recopilamos",
  "dataCollectionIntro": "En Student Assistant, recopilamos datos personales para mejorar nuestros servicios y la experiencia de aprendizaje. Los tipos de datos que recopilamos incluyen:",
  "contactInfo": "Información de contacto: como tu nombre, dirección de correo electrónico y número de teléfono.",
  "accountDetails": "Detalles de la cuenta: nombre de usuario, contraseña (encriptada) y otros identificadores.",
  "performanceData": "Datos de rendimiento: para personalizar experiencias de aprendizaje y ajustar desafíos.",
  "usageData": "Datos de uso: información sobre cómo interactúas con nuestros servicios, lo que nos ayuda a personalizar el contenido y mejorar la funcionalidad.",
  "dataUseTitle": "2. Cómo utilizamos tus datos",
  "dataUseIntro": "Tus datos personales se utilizan para:",
  "dataUseProvide": "Proporcionar, operar y mantener nuestros servicios.",
  "dataUseEnhance": "Mejorar, personalizar y expandir nuestros servicios.",
  "dataUseUnderstand": "Entender y analizar cómo utilizas nuestros servicios.",
  "dataUseDevelop": "Desarrollar nuevos productos, servicios, características y funcionalidades.",
  "dataUseCommunicate": "Comunicarnos contigo, ya sea directamente o a través de uno de nuestros socios, incluyendo para servicio al cliente, para proporcionarte actualizaciones y otra información relacionada con el sitio web, y para fines de marketing y promocionales.",
  "dataUseSend": "Enviarte correos electrónicos y otras comunicaciones en las que has optado participar.",
  "dataSharingTitle": "3. Compartir y divulgar datos",
  "dataSharingIntro": "Student Assistant puede compartir tus datos con:",
  "dataShareServiceProviders": "Proveedores de servicios que realizan servicios para nosotros y nos ayudan a operar nuestro negocio (por ejemplo, alojamiento, análisis, entrega de correo electrónico y servicios de gestión de bases de datos).",
  "dataShareThirdParties": "Terceros si creemos que la divulgación es aconsejable o necesaria para cumplir con la ley, hacer cumplir nuestros términos de uso, o proteger los derechos, la propiedad o la seguridad de Student Assistant o de otros.",
  "dataSharePotentialBuyers": "Compradores potenciales u otros sucesores en el evento de una fusión, desinversión, reestructuración, reorganización, disolución o otra venta o transferencia de algunos o todos los activos de Student Assistant.",
  "dataRightsTitle": "4. Derechos de protección de datos",
  "dataRightsIntro": "Bajo el GDPR, tienes los siguientes derechos de protección de datos:",
  "rightAccess": "El derecho de acceder, actualizar o eliminar la información que tenemos sobre ti.",
  "rightRectification": "El derecho de rectificación.",
  "rightObject": "El derecho a objetar.",
  "rightRestriction": "El derecho de restricción.",
  "rightPortability": "El derecho a la portabilidad de datos",
  "rightWithdraw": "El derecho a retirar el consentimiento.",
  "dataSecurityTitle": "5. Seguridad de los datos",
  "dataSecurityContent": "Utilizamos medidas de seguridad técnica y organizativa adecuadas diseñadas para proteger la seguridad de cualquier información personal que procesamos. Sin embargo, también recuerda que no podemos garantizar que Internet en sí sea 100% seguro.",
  "policyChangesTitle": "6. Cambios a esta política",
  "policyChangesContent": "Podemos actualizar nuestra Declaración de Cumplimiento de GDPR de vez en cuando. Te notificaremos cualquier cambio publicando la nueva política en esta página.",
  "contactUsTitle": "7. Contáctanos",
  "contactUsContent": "Si tienes alguna pregunta sobre esta Declaración de Cumplimiento de GDPR, puedes contactarnos:",
  "contactEmail": "Correo electrónico: privacy@studentassistant.com",
  "contactAddress": "Dirección postal: Student Assistant, [Insertar dirección aquí].",
  "pageTitle": "Opciones de Lenguajes de Programación",
  "headerLC": "Opciones de Lenguajes de Programación",
  "introLC": "Cada lenguaje de programación tiene sus fortalezas y es más adecuado para ciertos tipos de proyectos. Aquí tienes una breve descripción de algunos lenguajes de programación populares y para qué se utilizan comúnmente:",
  "pythonDescription": "Python: Mejor para: Desarrollo web, análisis de datos, inteligencia artificial (IA), aprendizaje automático (ML), computación científica y automatización. Fortalezas: Sintaxis fácil, legibilidad, extensas bibliotecas y marcos de trabajo (Django, Flask, Pandas, NumPy, TensorFlow), y una comunidad fuerte.",
  "javascriptDescription": "JavaScript: Mejor para: Desarrollo web (tanto front-end como back-end con Node.js), construcción de aplicaciones web interactivas, y desarrollo de aplicaciones de escritorio y móviles (con marcos como Electron y React Native). Fortalezas: Alta compatibilidad con navegadores web, capacidades de programación asíncrona, y un vasto ecosistema de bibliotecas y marcos (React, Angular, Vue.js).",
  "javaDescription": "Java: Mejor para: Sistemas de backend a nivel empresarial, desarrollo de aplicaciones Android, aplicaciones web y desarrollo de sistemas a gran escala. Fortalezas: Independencia de plataforma (escribe una vez, corre en cualquier lugar - WORA), bibliotecas estándar robustas, gestión de memoria fuerte, y uso generalizado en grandes organizaciones.",
  "csharpDescription": "C#: Mejor para: Desarrollo de aplicaciones Windows, desarrollo de juegos con Unity, aplicaciones empresariales y aplicaciones móviles (a través de Xamarin). Fortalezas: Integración perfecta con el marco .NET, tipado fuerte, extensas bibliotecas y buen soporte para programación paralela.",
  "cplusplusDescription": "C++: Mejor para: Desarrollo de sistemas/software, desarrollo de juegos, simulación en tiempo real, aplicaciones de alto rendimiento y aplicaciones cliente-servidor. Fortalezas: Cercanía al hardware, orientado a objetos, biblioteca estándar poderosa y control sobre los recursos del sistema.",
  "swiftDescription": "Swift: Mejor para: Aplicaciones iOS y macOS, y en menor medida, desarrollo de back-end web. Fortalezas: Seguridad (diseñado para eliminar el código inseguro), alto rendimiento e interoperabilidad con Objective-C.",
  "rubyDescription": "Ruby: Mejor para: Aplicaciones web, especialmente con el marco Ruby on Rails, y scripting. Fortalezas: Sintaxis elegante, facilidad de aprendizaje y un fuerte enfoque en la felicidad y productividad del desarrollador.",
  "phpDescription": "PHP: Mejor para: Desarrollo web del lado del servidor, sistemas de gestión de contenidos (como WordPress) y contenido dinámico de sitios web. Fortalezas: Amplio soporte de bases de datos, integración con varios marcos de desarrollo web (Laravel, Symfony) y extensa documentación.",
  "goDescription": "Go (Golang): Mejor para: Programación concurrente, microservicios, servicios web basados en la nube y aplicaciones de alto rendimiento. Fortalezas: Sintaxis simple, modelo de concurrencia eficiente, ejecución rápida y soporte integrado para recolección de basura.",
  "kotlinDescription": "Kotlin: Mejor para: Desarrollo de aplicaciones Android, desarrollo del lado del servidor y desarrollo de front-end web (a través de Kotlin/JS). Fortalezas: Interoperabilidad con Java, sintaxis concisa y expresiva, y características de seguridad (por ejemplo, seguridad contra nulos).",
  "closing": "Cada uno de estos lenguajes tiene su nicho donde brilla más brillantemente. La elección del lenguaje a menudo depende de los requisitos específicos del proyecto, la infraestructura existente, las consideraciones de rendimiento y la experiencia del equipo de desarrollo.",
  "userLogin": "Inicio de sesión de usuario",

  "navHome": "Inicio",
  "navTermsPolicies": "Términos y Políticas",
  "navFeedback": "Retroalimentación",
  "navAbout": "Acerca de",
  "navContact": "Contacto",
  "navPractice": "Práctica",
  "navLanguageChoice": "Elección de Idioma",
  "navChat": "Chat",
  "navLogin": "Iniciar Sesión",
  "navRegister": "Registrarse",
  "navChallenges": "Desafíos",
  "navIdiom": "Idioma",
  "navEnglish": "Inglés",
  "navFrench": "Francés",
  "navPortuguese": "Portugués",
  "navSpanish": "Español"
}
