{
  "welcome": "Bienvenue chez Student Assistant!",
  "empower": "Libérez votre parcours de codage aujourd'hui!",
  "unlock": "Débloquez le langage du futur",
  "codingSkill": "Le codage est une compétence essentielle dans le monde numérique d'aujourd'hui. Chez Student Assistant, nous sommes là pour rendre la programmation accessible à tous, adaptée à votre style et rythme d'apprentissage personnels.",
  "offer": "Ce que nous offrons",
  "personalizedLearning": "Guides d'apprentissage personnalisés : Commencez à partir de zéro ou améliorez vos compétences grâce à des guides et des leçons de programmation personnalisés.",
  "adaptiveLearning": "Technologies d'apprentissage adaptatives : Notre plateforme intelligente ajuste le niveau de défi en fonction de vos interactions, vous gardant constamment engagé.",
  "multilingualSupport": "Support multilingue : Apprenez dans la langue dans laquelle vous êtes le plus à l'aise, grâce à notre vaste support linguistique.",
  "collaborativeChat": "Chat collaboratif : Abordez des problèmes réels avec des pairs pour acquérir une expérience pratique et favoriser l'apprentissage communautaire.",
  "gamifiedExperience": "Expérience ludifiée : Rendez l'apprentissage amusant avec des défis ludifiés qui vous motivent et vous récompensent pour vos progrès et votre créativité.",
  "continuousFeedback": "Boucle de rétroaction continue : Nous évoluons avec vos retours, nous adaptant continuellement pour mieux répondre à vos besoins éducatifs.",
  "whyChooseUs": "Pourquoi nous choisir ?",
  "chooseUsDescription": "Chez Student Assistant, vous êtes plus qu'un apprenant – vous faites partie d'une communauté mondiale. Rejoignez-nous dans notre mission de démocratiser l'éducation au codage, en la rendant engageante, efficace et agréable pour tous.",
  "aboutStudentAssistant": "À propos de Student Assistant",
  "empoweringYourCodingJourney": "Libérez votre parcours de codage",
  "ourMission": "Notre mission",
  "ourMissionDescription": "Chez Student Assistant, nous sommes dédiés à transformer la manière dont les nouveaux codeurs apprennent et interagissent avec les langages de programmation. Fondé par un étudiant motivé de l'Université Solent, notre objectif est de rendre la codification plus accessible, compréhensible et attrayante pour tous, en particulier pour les débutants. Notre plateforme est construite sur la conviction que coder ne devrait pas être intimidant, mais une compétence abordable et agréable à apprendre.",
  "theChallenge": "Le Défi",
  "theChallengeDescription": "Apprendre à coder peut être intimidant. De nombreux étudiants peinent avec des cours traditionnels qui ne s'adaptent pas aux différentes vitesses ou styles d'apprentissage. Cet écart peut conduire à la frustration et à la démoralisation, rendant difficile pour les débutants de progresser dans l'apprentissage de cette compétence vitale.",
  "ourSolution": "Notre Solution",
  "ourSolutionDescription": "Student Assistant est sur le point de se lancer dans un avenir proche avec une suite de fonctionnalités conçues pour relever ces défis :",
  "personalizedLearningGuides": "Guides d'apprentissage personnalisés : Défis et projets de programmation adaptés à votre niveau de compétence et style d'apprentissage.",
  "adaptiveLearningTechnologies": "Technologies d'apprentissage adaptatives : Notre plateforme utilise des données en temps réel pour ajuster la difficulté et le type de défis de codage pour s'adapter à votre courbe d'apprentissage.",
  "interactiveAndEngagingContent": "Contenu interactif et captivant : Grâce à la ludification et à des modèles d'apprentissage interactifs, nous vous maintenons engagé et motivé.",
  "supportiveCommunity": "Communauté de soutien : Une approche pilotée par la communauté où les apprenants peuvent interagir, partager et grandir ensemble.",
  "visionForTheFuture": "Vision pour l'avenir",
  "visionForTheFutureDescription": "Nous aspirons à démocratiser l'éducation au codage à l'échelle mondiale, en garantissant que quiconque intéressé par l'apprentissage de la programmation dispose des outils et du soutien nécessaires pour réussir. Avec un accent sur l'amélioration continue et les retours des utilisateurs, Student Assistant évoluera pour répondre aux divers besoins des apprenants du monde entier.",
  "joinUs": "Rejoignez-nous pour façonner l'avenir de l'éducation au codage",
  "joinUsDescription": "Alors que nous nous préparons pour notre lancement prochain, nous vous invitons à faire partie de notre communauté. Que vous soyez un étudiant potentiel, un éducateur ou un passionné de technologie, votre contribution peut aider à façonner le meilleur environnement d'apprentissage possible.",
  "challenge1": "Défi 1",
  "helloWorld": "Bonjour, monde!",
  "helloWorldDescription": "Écrivez un programme qui affiche \"Bonjour, monde!\" sur l'écran.",
  "clickReveal": "Cliquez sur le bouton ci-dessous pour révéler le fragment de code.",
  "reveal": "Révéler",
  "challenge2": "Défi 2",
  "simpleCalculator": "Calculatrice Simple",
  "simpleCalculatorDescription": "Créez un programme qui prend deux nombres en entrée et permet à l'utilisateur d'effectuer des opérations arithmétiques de base telles que l'addition, la soustraction, la multiplication et la division.",
  "challenge3": "Défi 3",
  "fizzBuzz": "FizzBuzz",
  "fizzBuzzDescription": "Écrivez un programme qui imprime les nombres de 1 à 100. Pour les multiples de trois, imprimez \"Fizz\" au lieu du nombre, et pour les multiples de cinq, imprimez \"Buzz\". Pour les nombres qui sont multiples à la fois de trois et de cinq, imprimez \"FizzBuzz\".",
  "sendButton": "Envoyer",
  "contactUs": "Contactez-nous",
  "contactUsDescription": "Nous sommes là pour aider ! Connectez-vous avec Student Assistant pour toute question ou soutien.",
  "emailUs": "Envoyez-nous un email",
  "generalInquiries": "Demandes générales : info@studentassistant.com",
  "support": "Support : support@studentassistant.com",
  "feedback": "Feedback : feedback@studentassistant.com",
  "callUs": "Appelez-nous",
  "phone": "Téléphone : +1 234 567 8900",
  "followUs": "Suivez-nous",
  "followUsDescription": "Restez informé en nous suivant sur les réseaux sociaux :",
  "facebook": "Facebook : StudentAssistantFB",
  "twitter": "Twitter : @StudentAssist",
  "linkedin": "LinkedIn : Student-Assistant",
  "mailingAddress": "Adresse postale",
  "address1": "Student Assistant",
  "address2": "123 Coding Ave, Suite 100",
  "address3": "Tech City, TE 12345",
  "valueFeedback": "Nous apprécions vos retours",
  "valueFeedbackDescription": "Vos idées nous aident à améliorer et à personnaliser notre plateforme pour mieux répondre à vos besoins. Veuillez partager vos réflexions sur la manière dont nous pouvons améliorer Student Assistant.",
  "shareFeedback": "Partagez vos retours",
  "shareFeedbackDescription": "Nous apprécions votre temps et votre effort pour nous aider à faire de Student Assistant la meilleure ressource pour apprendre à coder. Vos retours sont cruciaux pour nous afin de comprendre ce qui fonctionne bien et ce qui peut être amélioré.",
  "surveyDescription": "Veuillez prendre quelques minutes pour remplir notre enquête de retours en cliquant sur le lien ci-dessous :",
  "surveyLink": "URL_TO_SURVEY",
  "surveyLinkText": "Participez à l'enquête de retours",
  "surveyAspects": "Cette enquête vous demandera votre avis sur divers aspects de notre plateforme, y compris :",
  "surveyAspectsList": [
    "Facilité d'utilisation",
    "Qualité du contenu",
    "Personnalisation des parcours d'apprentissage",
    "Interaction avec la communauté et soutien",
    "Satisfaction générale"
  ],
  "whyFeedback": "Pourquoi vos retours sont importants",
  "whyFeedbackDescription": "Vos retours influencent directement le développement et l'amélioration de nos services. Ils nous aident à :",
  "whyFeedbackList": [
    "Identifier les domaines nécessitant une amélioration",
    "Comprendre plus largement les besoins des utilisateurs",
    "Créer un environnement d'apprentissage plus engageant et efficace"
  ],
  "thankYou": "Merci",
  "thankYouDescription": "Merci d'être une partie de notre communauté et de prendre le temps de nous aider à grandir et à nous améliorer. Nous nous engageons à affiner continuellement notre plateforme pour mieux vous servir.",
  "header": "IDE en ligne Codeboard",
  "selectLanguage": "Sélectionnez la langue : &nbsp; &nbsp;",
  "runButton": "Exécuter",
  "userRegistration": "Inscription de l'utilisateur",
  "nameLabel": "Nom :",
  "emailLabel": "Email :",
  "passwordLabel": "Mot de passe :",
  "submitButton": "Soumettre",
  "gdprTitle": "Déclaration de conformité au RGPD",
  "gdprIntro": "Student Assistant s'engage à protéger les données personnelles et la vie privée de nos utilisateurs. Nous adhérons strictement aux directives établies par le Règlement Général sur la Protection des Données (RGPD), en vigueur depuis le 25 mai 2018.",
  "dataCollectionTitle": "1. Données personnelles que nous collectons",
  "dataCollectionIntro": "Chez Student Assistant, nous collectons des données personnelles pour améliorer nos services et l'expérience d'apprentissage. Les types de données que nous collectons incluent :",
  "contactInfo": "Informations de contact : telles que votre nom, adresse email et numéro de téléphone.",
  "accountDetails": "Détails du compte : nom d'utilisateur, mot de passe (crypté) et autres identifiants.",
  "performanceData": "Données de performance : pour personnaliser les expériences d'apprentissage et ajuster les défis.",
  "usageData": "Données d'utilisation : informations sur la manière dont vous interagissez avec nos services, ce qui nous aide à personnaliser le contenu et à améliorer la fonctionnalité.",
  "dataUseTitle": "2. Comment nous utilisons vos données",
  "dataUseIntro": "Vos données personnelles sont utilisées pour :",
  "dataUseProvide": "Fournir, exploiter et maintenir nos services.",
  "dataUseEnhance": "Améliorer, personnaliser et développer nos services.",
  "dataUseUnderstand": "Comprendre et analyser comment vous utilisez nos services.",
  "dataUseDevelop": "Développer de nouveaux produits, services, fonctionnalités et fonctionnalités.",
  "dataUseCommunicate": "Communiquer avec vous, directement ou par l'intermédiaire de l'un de nos partenaires, y compris pour le service client, pour vous fournir des mises à jour et d'autres informations relatives au site Web, et à des fins de marketing et de promotion.",
  "dataUseSend": "Vous envoyer des emails et d'autres communications auxquelles vous avez opté.",
  "dataSharingTitle": "3. Partage et divulgation des données",
  "dataSharingIntro": "Student Assistant peut partager vos données avec :",
  "dataShareServiceProviders": "Des prestataires de services qui effectuent des services pour nous et nous aident à exploiter notre entreprise (par exemple, hébergement, analyse, livraison d'email et services de gestion de base de données).",
  "dataShareThirdParties": "Des tiers si nous estimons que la divulgation est conseillée ou nécessaire pour se conformer à la loi, faire respecter nos conditions d'utilisation, ou protéger les droits, la propriété ou la sécurité de Student Assistant ou d'autres.",
  "dataSharePotentialBuyers": "Des acheteurs potentiels ou d'autres successeurs en cas de fusion, cession, restructuration, réorganisation, dissolution ou autre vente ou transfert de tout ou partie des actifs de Student Assistant.",
  "dataRightsTitle": "4. Droits de protection des données",
  "dataRightsIntro": "Sous le RGPD, vous avez les droits de protection des données suivants :",
  "rightAccess": "Le droit d'accéder, de mettre à jour ou de supprimer les informations que nous avons sur vous.",
  "rightRectification": "Le droit de rectification.",
  "rightObject": "Le droit de s'opposer.",
  "rightRestriction": "Le droit de restriction.",
  "rightPortability": "Le droit à la portabilité des données",
  "rightWithdraw": "Le droit de retirer le consentement.",
  "dataSecurityTitle": "5. Sécurité des données",
  "dataSecurityContent": "Nous utilisons des mesures de sécurité techniques et organisationnelles appropriées conçues pour protéger la sécurité de toute information personnelle que nous traitons. Cependant, veuillez également rappeler que nous ne pouvons pas garantir que Internet lui-même est 100% sécurisé.",
  "policyChangesTitle": "6. Changements à cette politique",
  "policyChangesContent": "Nous pouvons mettre à jour notre Déclaration de conformité au RGPD de temps à autre. Nous vous informerons de tout changement en publiant la nouvelle politique sur cette page.",
  "contactUsTitle": "7. Contactez-nous",
  "contactUsContent": "Si vous avez des questions concernant cette Déclaration de conformité au RGPD, vous pouvez nous contacter :",
  "contactEmail": "Email : privacy@studentassistant.com",
  "contactAddress": "Adresse postale : Student Assistant, [Insérer l'adresse ici].",
  "pageTitle": "Choix des langages de programmation",
  "headerLC": "Choix des langages de programmation",
  "introLC": "Chaque langage de programmation a ses forces et est le mieux adapté pour certains types de projets. Voici un bref aperçu de certains langages de programmation populaires et de leurs utilisations courantes :",
  "pythonDescription": "Python : Meilleur pour : Développement web, analyse de données, intelligence artificielle (IA), apprentissage automatique (ML), calcul scientifique et automatisation. Forces : Syntaxe facile, lisibilité, bibliothèques et cadres étendus (Django, Flask, Pandas, NumPy, TensorFlow), et une communauté solide.",
  "javascriptDescription": "JavaScript : Meilleur pour : Développement web (front-end et back-end avec Node.js), création d'applications web interactives, et développement d'applications de bureau et mobiles (avec des cadres comme Electron et React Native). Forces : Compatibilité élevée avec les navigateurs web, capacités de programmation asynchrone, et un vaste écosystème de bibliothèques et de cadres (React, Angular, Vue.js).",
  "javaDescription": "Java : Meilleur pour : Systèmes backend de niveau entreprise, développement d'applications Android, applications web et développement de systèmes à grande échelle. Forces : Indépendance de la plateforme (écrire une fois, exécuter partout - WORA), bibliothèques standard robustes, gestion solide de la mémoire, et utilisation répandue dans les grandes organisations.",
  "csharpDescription": "C# : Meilleur pour : Développement d'applications Windows, développement de jeux avec Unity, applications d'entreprise et applications mobiles (via Xamarin). Forces : Intégration transparente avec le cadre .NET, typage fort, bibliothèques étendues, et bon support pour la programmation parallèle.",
  "cplusplusDescription": "C++ : Meilleur pour : Développement de systèmes/logiciels, développement de jeux, simulation en temps réel, applications haute performance et applications client-serveur. Forces : Proximité avec le matériel, orienté objet, bibliothèque standard puissante et contrôle sur les ressources système.",
  "swiftDescription": "Swift : Meilleur pour : Applications iOS et macOS, et dans une moindre mesure, développement backend web. Forces : Sécurité (conçu pour éliminer le code dangereux), performances rapides et interopérabilité avec Objective-C.",
  "rubyDescription": "Ruby : Meilleur pour : Applications web, en particulier avec le cadre Ruby on Rails, et scripting. Forces : Syntaxe élégante, facilité d'apprentissage et un fort accent sur le bonheur et la productivité des développeurs.",
  "phpDescription": "PHP : Meilleur pour : Développement web côté serveur, systèmes de gestion de contenu (comme WordPress), et contenu de site web dynamique. Forces : Large support de bases de données, intégration avec divers cadres de développement web (Laravel, Symfony), et documentation étendue.",
  "goDescription": "Go (Golang) : Meilleur pour : Programmation concurrentielle, microservices, services web basés sur le cloud et applications haute performance. Forces : Syntaxe simple, modèle de concurrence efficace, exécution rapide, et support intégré pour la collecte des ordures.",
  "kotlinDescription": "Kotlin : Meilleur pour : Développement d'applications Android, développement côté serveur, et développement front-end web (via Kotlin/JS). Forces : Interopérabilité avec Java, syntaxe concise et expressive, et caractéristiques de sécurité (par exemple, sécurité contre les valeurs nulles).",
  "closing": "Chacun de ces langages a son créneau où il brille le plus. Le choix du langage dépend souvent des besoins spécifiques du projet, de l'infrastructure existante, des considérations de performance, et de l'expertise de l'équipe de développement.",
  "userLogin": "Connexion utilisateur",


  
  "navHome": "Accueil",
  "navTermsPolicies": "Termes et Politiques",
  "navFeedback": "Retour",
  "navAbout": "À propos",
  "navContact": "Contact",
  "navPractice": "Pratique",
  "navLanguageChoice": "Choix de Langue",
  "navChat": "Chat",
  "navLogin": "Connexion",
  "navRegister": "Inscription",
  "navChallenges": "Défis",
  "navIdiom": "Langue",
  "navEnglish": "Anglais",
  "navFrench": "Français",
  "navPortuguese": "Portugais",
  "navSpanish": "Espagnol"
}

