{
  "welcome": "Bem-vindo ao Student Assistant!",
  "empower": "Potencialize sua jornada de codificação hoje!",
  "unlock": "Desbloqueie a Linguagem do Futuro",
  "codingSkill": "Codificar é uma habilidade essencial no mundo digital de hoje. No Student Assistant, estamos aqui para tornar a programação acessível a todos, adaptada ao seu estilo e ritmo de aprendizagem pessoal.",
  "offer": "O que Oferecemos",
  "personalizedLearning": "Guias de Aprendizado Personalizados: Comece do zero ou aprimore suas habilidades através de guias e lições de programação personalizadas.",
  "adaptiveLearning": "Tecnologias de Aprendizado Adaptativo: Nossa plataforma inteligente ajusta o nível de desafio com base em suas interações, mantendo você constantemente engajado.",
  "multilingualSupport": "Suporte Multilíngue: Aprenda no idioma com o qual você se sente mais confortável, graças ao nosso amplo suporte linguístico.",
  "collaborativeChat": "Chat Colaborativo: Enfrente problemas reais com colegas para ganhar experiência prática e promover a aprendizagem comunitária.",
  "gamifiedExperience": "Experiência Gamificada: Torne o aprendizado divertido com desafios gamificados que motivam e recompensam você por seu progresso e criatividade.",
  "continuousFeedback": "Ciclo Contínuo de Feedback: Evoluímos com seus comentários, adaptando-nos continuamente para melhor atender às suas necessidades educacionais.",
  "whyChooseUs": "Por que Escolher-nos?",
  "chooseUsDescription": "No Student Assistant, você é mais do que um aprendiz - você faz parte de uma comunidade global. Junte-se a nós em nossa missão de democratizar a educação em codificação, tornando-a envolvente, eficaz e agradável para todos.",
  "aboutStudentAssistant": "Sobre o Student Assistant",
  "empoweringYourCodingJourney": "Empoderando Sua Jornada de Codificação",
  "ourMission": "Nossa Missão",
  "ourMissionDescription": "No Student Assistant, estamos dedicados a transformar como os novos programadores aprendem e interagem com as linguagens de programação. Fundado por um estudante determinado da Solent University, nosso objetivo é tornar a codificação mais acessível, compreensível e atraente para todos, especialmente para iniciantes. Nossa plataforma é baseada na crença de que codificar não deve ser intimidador, mas uma habilidade acessível e prazerosa.",
  "theChallenge": "O Desafio",
  "theChallengeDescription": "Aprender a programar pode ser desafiador. Muitos estudantes lutam com cursos tradicionais que não se adaptam a diferentes velocidades ou estilos de aprendizagem. Essa lacuna pode levar à frustração e desmotivação, tornando difícil para os iniciantes progredirem no aprendizado dessa habilidade vital.",
  "ourSolution": "Nossa Solução",
  "ourSolutionDescription": "O Student Assistant está prestes a ser lançado em um futuro próximo com um conjunto de recursos projetados para enfrentar esses desafios:",
  "personalizedLearningGuides": "Guias de Aprendizado Personalizados: Desafios e projetos de programação adaptados ao seu nível de habilidade e estilo de aprendizado.",
  "adaptiveLearningTechnologies": "Tecnologias de Aprendizado Adaptativo: Nossa plataforma usa dados em tempo real para ajustar a dificuldade e o tipo de desafios de codificação para se adequar à sua curva de aprendizado.",
  "interactiveAndEngagingContent": "Conteúdo Interativo e Cativante: Através da gamificação e modelos de aprendizado interativos, mantemos você engajado e motivado.",
  "supportiveCommunity": "Comunidade de Suporte: Uma abordagem impulsionada pela comunidade onde os aprendizes podem interagir, compartilhar e crescer juntos.",
  "visionForTheFuture": "Visão para o Futuro",
  "visionForTheFutureDescription": "Aspiramos democratizar a educação em programação globalmente, garantindo que qualquer pessoa interessada em aprender a programar tenha as ferramentas e o suporte necessários para ter sucesso. Com foco em melhoria contínua e feedback do usuário, o Student Assistant evoluirá para atender às diversas necessidades dos aprendizes em todo o mundo.",
  "joinUs": "Junte-se a Nós para Moldar o Futuro da Educação em Programação",
  "joinUsDescription": "Enquanto nos preparamos para nosso lançamento iminente, convidamos você a fazer parte de nossa comunidade. Seja você um estudante em potencial, educador ou entusiasta da tecnologia, sua contribuição pode ajudar a moldar o melhor ambiente de aprendizado possível.",
  "challenge1": "Desafio 1",
  "helloWorld": "Olá, Mundo!",
  "helloWorldDescription": "Escreva um programa que exiba \"Olá, Mundo!\" na tela.",
  "clickReveal": "Clique no botão abaixo para revelar o trecho de código.",
  "reveal": "Revelar",
  "challenge2": "Desafio 2",
  "simpleCalculator": "Calculadora Simples",
  "simpleCalculatorDescription": "Crie um programa que receba dois números como entrada e permita ao usuário realizar operações aritméticas básicas, como adição, subtração, multiplicação e divisão.",
  "challenge3": "Desafio 3",
  "fizzBuzz": "FizzBuzz",
  "fizzBuzzDescription": "Escreva um programa que imprima os números de 1 a 100. Para múltiplos de três, imprima \"Fizz\" em vez do número, e para múltiplos de cinco, imprima \"Buzz\". Para números que são múltiplos de ambos, três e cinco, imprima \"FizzBuzz\".",
  "sendButton": "Enviar",
  "contactUs": "Fale Conosco",
  "contactUsDescription": "Estamos aqui para ajudar! Conecte-se com o Student Assistant para qualquer dúvida ou suporte.",
  "emailUs": "Envie-nos um Email",
  "generalInquiries": "Perguntas Gerais: info@studentassistant.com",
  "support": "Suporte: support@studentassistant.com",
  "feedback": "Feedback: feedback@studentassistant.com",
  "callUs": "Ligue para Nós",
  "phone": "Telefone: +1 234 567 8900",
  "followUs": "Siga-nos",
  "followUsDescription": "Mantenha-se atualizado seguindo-nos nas redes sociais:",
  "facebook": "Facebook: StudentAssistantFB",
  "twitter": "Twitter: @StudentAssist",
  "linkedin": "LinkedIn: Student-Assistant",
  "mailingAddress": "Endereço para Correspondência",
  "address1": "Student Assistant",
  "address2": "123 Coding Ave, Suíte 100",
  "address3": "Cidade Tecnológica, TE 12345",
  "valueFeedback": "Valorizamos Seu Feedback",
  "valueFeedbackDescription": "Suas percepções nos ajudam a melhorar e personalizar nossa plataforma para melhor atender às suas necessidades. Por favor, compartilhe seus pensamentos sobre como podemos melhorar o Student Assistant.",
  "shareFeedback": "Compartilhe Seu Feedback",
  "shareFeedbackDescription": "Agradecemos seu tempo e esforço para nos ajudar a tornar o Student Assistant o melhor recurso para aprender a programar. Seu feedback é crucial para nós para entender o que funciona bem e o que pode ser melhorado.",
  "surveyDescription": "Por favor, reserve alguns minutos para preencher nossa pesquisa de feedback clicando no link abaixo:",
  "surveyLink": "URL_PARA_PESQUISA",
  "surveyLinkText": "Participe da Pesquisa de Feedback",
  "surveyAspects": "Esta pesquisa perguntará sobre vários aspectos de nossa plataforma, incluindo:",
  "surveyAspectsList": [
    "Facilidade de uso",
    "Qualidade do conteúdo",
    "Personalização dos caminhos de aprendizado",
    "Interação com a comunidade e suporte",
    "Satisfação geral"
  ],
  "whyFeedback": "Por Que Seu Feedback é Importante",
  "whyFeedbackDescription": "Seu feedback influencia diretamente o desenvolvimento e a melhoria de nossos serviços. Isso nos ajuda a:",
  "whyFeedbackList": [
    "Identificar áreas que precisam de melhoria",
    "Entender mais completamente as necessidades dos usuários",
    "Criar um ambiente de aprendizado mais envolvente e eficaz"
  ],
  "thankYou": "Obrigado",
  "thankYouDescription": "Obrigado por fazer parte de nossa comunidade e por dedicar tempo para nos ajudar a crescer e melhorar. Estamos comprometidos em refinar continuamente nossa plataforma para atendê-lo melhor.",
  "header": "IDE Online Codeboard",
  "selectLanguage": "Selecione o Idioma: ;",
  "runButton": "Executar",
  "userRegistration": "Registro de Usuário",
  "nameLabel": "Nome:",
  "emailLabel": "E-mail:",
  "passwordLabel": "Senha:",
  "submitButton": "Enviar",
  "gdprTitle": "Declaração de Conformidade com o GDPR",
  "gdprIntro": "O Student Assistant compromete-se a garantir a proteção dos dados pessoais e a privacidade de nossos usuários. Adotamos estritamente as diretrizes estabelecidas pelo Regulamento Geral sobre a Proteção de Dados (GDPR), efetivo a partir de 25 de maio de 2018.",
  "dataCollectionTitle": "1. Dados Pessoais que Coletamos",
  "dataCollectionIntro": "No Student Assistant, coletamos dados pessoais para melhorar nossos serviços e a experiência de aprendizado. Os tipos de dados que coletamos incluem:",
  "contactInfo": "Informações de Contato: como seu nome, endereço de e-mail e número de telefone.",
  "accountDetails": "Detalhes da Conta: nome de usuário, senha (criptografada) e outros identificadores.",
  "performanceData": "Dados de Desempenho: para personalizar experiências de aprendizado e ajustar desafios.",
  "usageData": "Dados de Uso: informações sobre como você interage com nossos serviços, o que nos ajuda a personalizar o conteúdo e melhorar a funcionalidade.",
  "dataUseTitle": "2. Como Usamos Seus Dados",
  "dataUseIntro": "Seus dados pessoais são usados para:",
  "dataUseProvide": "Fornecer, operar e manter nossos serviços.",
  "dataUseEnhance": "Aprimorar, personalizar e expandir nossos serviços.",
  "dataUseUnderstand": "Entender e analisar como você usa nossos serviços.",
  "dataUseDevelop": "Desenvolver novos produtos, serviços, funcionalidades e funcionalidades.",
  "dataUseCommunicate": "Comunicar com você, diretamente ou através de um de nossos parceiros, incluindo para serviço ao cliente, para fornecer-lhe atualizações e outras informações relacionadas ao site, e para fins de marketing e promocionais.",
  "dataUseSend": "Enviar-lhe e-mails e outras comunicações nas quais você optou por participar.",
  "dataSharingTitle": "3. Compartilhamento e Divulgação de Dados",
  "dataSharingIntro": "O Student Assistant pode compartilhar seus dados com:",
  "dataShareServiceProviders": "Fornecedores de serviços que realizam serviços para nós e nos ajudam a operar nosso negócio (por exemplo, hospedagem, análise, entrega de e-mail e serviços de gestão de bases de dados).",
  "dataShareThirdParties": "Terceiros, se acreditarmos que a divulgação é aconselhável ou necessária para cumprir com a lei, fazer cumprir nossos termos de uso ou proteger os direitos, propriedade ou segurança do Student Assistant ou de outros.",
  "dataSharePotentialBuyers": "Compradores potenciais ou outros sucessores no evento de uma fusão, alienação, reestruturação, reorganização, dissolução ou outra venda ou transferência de alguns ou todos os ativos do Student Assistant.",
  "dataRightsTitle": "4. Direitos de Proteção de Dados",
  "dataRightsIntro": "Sob o GDPR, você possui os seguintes direitos de proteção de dados:",
  "rightAccess": "O direito de acessar, atualizar ou excluir as informações que temos sobre você.",
  "rightRectification": "O direito de retificação.",
  "rightObject": "O direito de objeção.",
  "rightRestriction": "O direito de restrição.",
  "rightPortability": "O direito à portabilidade dos dados",
  "rightWithdraw": "O direito de retirar o consentimento.",
  "dataSecurityTitle": "5. Segurança de Dados",
  "dataSecurityContent": "Usamos medidas de segurança técnicas e organizacionais apropriadas projetadas para proteger a segurança de qualquer informação pessoal que processamos. No entanto, lembre-se também de que não podemos garantir que a própria internet seja 100% segura.",
  "policyChangesTitle": "6. Mudanças nesta Política",
  "policyChangesContent": "Podemos atualizar nossa Declaração de Conformidade com o GDPR de tempos em tempos. Notificaremos você sobre quaisquer alterações ao publicar a nova política nesta página.",
  "contactUsTitle": "7. Fale Conosco",
  "contactUsContent": "Se você tiver alguma dúvida sobre esta Declaração de Conformidade com o GDPR, pode nos contatar:",
  "contactEmail": "E-mail: privacy@studentassistant.com",
  "contactAddress": "Endereço para Correspondência: Student Assistant, [Insira o endereço aqui].",
  "pageTitle": "Escolhas de Linguagens de Programação",
  "headerLC": "Escolhas de Linguagens de Programação",
  "introLC": "Cada linguagem de programação tem suas forças e é mais adequada para certos tipos de projetos. Aqui está uma breve visão geral de algumas linguagens de programação populares e para o que são comumente usadas:",
  "pythonDescription": "Python: Melhor para: Desenvolvimento web, análise de dados, inteligência artificial (IA), aprendizado de máquina (ML), computação científica e automação. Forças: Sintaxe fácil, legibilidade, bibliotecas e frameworks extensos (Django, Flask, Pandas, NumPy, TensorFlow) e uma comunidade forte.",
  "javascriptDescription": "JavaScript: Melhor para: Desenvolvimento web (front-end e back-end com Node.js), construção de aplicativos web interativos e desenvolvimento de aplicativos de desktop e móveis (com frameworks como Electron e React Native). Forças: Alta compatibilidade com navegadores web, capacidades de programação assíncrona e um vasto ecossistema de bibliotecas e frameworks (React, Angular, Vue.js).",
  "javaDescription": "Java: Melhor para: Sistemas de back-end de nível empresarial, desenvolvimento de aplicativos Android, aplicativos web e desenvolvimento de sistemas em grande escala. Forças: Independência de plataforma (escreva uma vez, execute em qualquer lugar - WORA), bibliotecas padrão robustas, forte gerenciamento de memória e uso generalizado em grandes organizações.",
  "csharpDescription": "C#: Melhor para: Desenvolvimento de aplicativos Windows, desenvolvimento de jogos com Unity, aplicativos empresariais e aplicativos móveis (via Xamarin). Forças: Integração perfeita com o framework .NET, tipagem forte, bibliotecas extensas e bom suporte para programação paralela.",
  "cplusplusDescription": "C++: Melhor para: Desenvolvimento de sistemas/software, desenvolvimento de jogos, simulação em tempo real, aplicativos de alto desempenho e aplicativos cliente-servidor. Forças: Proximidade com o hardware, orientado a objetos, biblioteca padrão poderosa e controle sobre recursos do sistema.",
  "swiftDescription": "Swift: Melhor para: Aplicações iOS e macOS e, em menor medida, desenvolvimento de back-end web. Forças: Segurança (projetado para eliminar código inseguro), alto desempenho e interoperabilidade com Objective-C.",
  "rubyDescription": "Ruby: Melhor para: Aplicações web, especialmente com o framework Ruby on Rails, e scripting. Forças: Sintaxe elegante, facilidade de aprendizagem e um forte foco na felicidade e produtividade do desenvolvedor.",
  "phpDescription": "PHP: Melhor para: Desenvolvimento web do lado do servidor, sistemas de gestão de conteúdo (como WordPress) e conteúdo dinâmico de sites. Forças: Amplo suporte a bancos de dados, integração com vários frameworks de desenvolvimento web (Laravel, Symfony) e documentação extensa.",
  "goDescription": "Go (Golang): Melhor para: Programação concorrente, microserviços, serviços web baseados em nuvem e aplicativos de alto desempenho. Forças: Sintaxe simples, modelo de concorrência eficiente, execução rápida e suporte integrado para coleta de lixo.",
  "kotlinDescription": "Kotlin: Melhor para: Desenvolvimento de aplicativos Android, desenvolvimento do lado do servidor e desenvolvimento de front-end web (via Kotlin/JS). Forças: Interoperabilidade com Java, sintaxe concisa e expressiva, e recursos de segurança (por exemplo, segurança contra nulos).",
  "closing": "Cada uma dessas linguagens tem seu nicho onde brilha mais. A escolha da linguagem muitas vezes depende dos requisitos específicos do projeto, da infraestrutura existente, das considerações de desempenho e da experiência da equipe de desenvolvimento.",
  "userLogin": "Login do Usuário",


  "navHome": "Início",
  "navTermsPolicies": "Termos e Políticas",
  "navFeedback": "Feedback",
  "navAbout": "Sobre",
  "navContact": "Contato",
  "navPractice": "Prática",
  "navLanguageChoice": "Escolha de Idioma",
  "navChat": "Chat",
  "navLogin": "Entrar",
  "navRegister": "Registrar",
  "navChallenges": "Desafios",
  "navIdiom": "Idioma",
  "navEnglish": "Inglês",
  "navFrench": "Francês",
  "navPortuguese": "Português",
  "navSpanish": "Espanhol"
}

