{
  "welcome": "Welcome to Student Assistant!",
  "empower": "Empower Your Coding Journey Today!",
  "unlock": "Unlock the Language of the Future",
  "codingSkill": "Coding is an essential skill in today’s digital world. At Student Assistant, we're here to make coding accessible to everyone, tailored to fit your personal learning style and pace.",
  "offer": "What We Offer",
  "personalizedLearning": "Personalised Learning Guides: Start from scratch or enhance your skills through customised programming guides and lessons.",
  "adaptiveLearning": "Adaptive Learning Technologies: Our smart platform adjusts the challenge level based on your interactions, keeping you perpetually engaged.",
  "multilingualSupport": "Multilingual Support: Learn in the language you're most comfortable with, thanks to our extensive language support.",
  "collaborativeChat": "Collaborative Chat: Tackle real-world problems with peers to gain practical experience and foster community learning.",
  "gamifiedExperience": "Gamified Experience: Make learning fun with gamified challenges that motivate and reward you for your progress and creativity.",
  "continuousFeedback": "Continuous Feedback Loop: We evolve with your feedback, continuously adapting to better meet your educational needs.",
  "whyChooseUs": "Why Choose Us?",
  "chooseUsDescription": "At Student Assistant, you’re more than just a learner, you’re part of a global community. Join us in our mission to democratise coding education, making it engaging, effective, and enjoyable for everyone.",
  "aboutStudentAssistant": "About Student Assistant",
  "empoweringYourCodingJourney": "Empowering Your Coding Journey",
  "ourMission": "Our Mission",
  "ourMissionDescription": "At Student Assistant, we're dedicated to transforming how new coders learn and interact with programming languages. Founded by a driven student at Solent University, our goal is to make coding more accessible, understandable, and engaging for everyone, especially beginners. Our platform is built on the belief that coding should not be intimidating, but a skill that is approachable and enjoyable to learn.",
  "theChallenge": "The Challenge",
  "theChallengeDescription": "Learning to code can be daunting. Many students struggle with conventional one-size-fits-all courses that do not accommodate different learning speeds or styles. This gap can lead to frustration and demotivation, making it difficult for beginners to progress in learning this vital skill.",
  "ourSolution": "Our Solution",
  "ourSolutionDescription": "Student Assistant is set to launch in the near future with a suite of features designed to address these challenges:",
  "personalizedLearningGuides": "Personalised Learning Guides: Tailored programming challenges and projects that cater to your individual skill level and learning style.",
  "adaptiveLearningTechnologies": "Adaptive Learning Technologies: Our platform uses real-time data to adjust the difficulty and type of coding challenges to suit your learning curve.",
  "interactiveAndEngagingContent": "Interactive and Engaging Content: Through gamification and interactive learning models, we keep you engaged and motivated.",
  "supportiveCommunity": "Supportive Community: A community-driven approach where learners can interact, share, and grow together.",
  "visionForTheFuture": "Vision for the Future",
  "visionForTheFutureDescription": "We aim to democratise coding education globally, ensuring that anyone interested in learning to code has the tools and support they need to succeed. With a focus on continuous improvement and user feedback, Student Assistant will evolve to meet the diverse needs of learners worldwide.",
  "joinUs": "Join Us in Shaping the Future of Coding Education",
  "joinUsDescription": "As we prepare for our upcoming launch, we invite you to be part of our community. Whether you’re a potential student, educator, or tech enthusiast, your input can help shape the best possible learning environment.",
  "challenge1": "Challenge 1",
  "helloWorld": "Hello, World!",
  "helloWorldDescription": "Write a program that prints \"Hello, World!\" to the screen.",
  "clickReveal": "Click the button below to reveal the code snippet.",
  "reveal": "Reveal",
  "challenge2": "Challenge 2",
  "simpleCalculator": "Simple Calculator",
  "simpleCalculatorDescription": "Create a program that takes two numbers as input and allows the user to perform basic arithmetic operations like addition, subtraction, multiplication, and division.",
  "challenge3": "Challenge 3",
  "fizzBuzz": "FizzBuzz",
  "fizzBuzzDescription": "Write a program that prints the numbers from 1 to 100. For multiples of three, print \"Fizz\" instead of the number, and for multiples of five, print \"Buzz\". For numbers which are multiples of both three and five, print \"FizzBuzz\".",
  "sendButton": "Send",
  "contactUs": "Contact Us",
  "contactUsDescription": "We're here to help! Connect with Student Assistant for any questions or support.",
  "emailUs": "Email Us",
  "generalInquiries": "General Inquiries: info@studentassistant.com",
  "support": "Support: support@studentassistant.com",
  "feedback": "Feedback: feedback@studentassistant.com",
  "callUs": "Call Us",
  "phone": "Phone: +1 234 567 8900",
  "followUs": "Follow Us",
  "followUsDescription": "Stay updated by following us on social media:",
  "facebook": "Facebook: StudentAssistantFB",
  "twitter": "Twitter: @StudentAssist",
  "linkedin": "LinkedIn: Student-Assistant",
  "mailingAddress": "Mailing Address",
  "address1": "Student Assistant",
  "address2": "123 Coding Ave, Suite 100",
  "address3": "Tech City, TE 12345",
  "valueFeedback": "We Value Your Feedback",
  "valueFeedbackDescription": "Your insights help us improve and tailor our platform to better meet your needs. Please share your thoughts on how we can enhance Student Assistant.",
  "shareFeedback": "Share Your Feedback",
  "shareFeedbackDescription": "We appreciate your time and effort in helping us make Student Assistant the best resource for learning to code. Your feedback is crucial for us to understand what works well and what can be improved.",
  "surveyDescription": "Please take a few minutes to fill out our feedback survey by clicking the link below:",
  "surveyLink": "URL_TO_SURVEY",
  "surveyLinkText": "Take the Feedback Survey",
  "surveyAspects": "This survey will ask you about various aspects of our platform, including:",
  "surveyAspectsList": [
    "Ease of use",
    "Content quality",
    "Personalisation of learning paths",
    "Support and community interaction",
    "Overall satisfaction"
  ],
  "whyFeedback": "Why Your Feedback Matters",
  "whyFeedbackDescription": "Your feedback directly influences the development and improvement of our services. It helps us:",
  "whyFeedbackList": [
    "Identify areas that need enhancement",
    "Understand user needs more comprehensively",
    "Create a more engaging and effective learning environment"
  ],
  "thankYou": "Thank You",
  "thankYouDescription": "Thank you for being a part of our community and for taking the time to help us grow and improve. We are committed to continuously refining our platform to serve you better.",
  "header": "Codeboard Online IDE",
  "selectLanguage": "Select Language: ",
  "runButton": "Run",
  "userRegistration": "User Registration",
  "nameLabel": "Name:",
  "emailLabel": "Email:",
  "passwordLabel": "Password:",
  "passwordLabel2": "Confirm Password:",
  "submitButton": "Submit",
  "gdprTitle": "GDPR Compliance Statement",
  "gdprIntro": "Student Assistant is committed to ensuring the protection of personal data and the privacy of our users. We adhere strictly to the guidelines set out by the General Data Protection Regulation (GDPR), effective as of May 25, 2018.",
  "dataCollectionTitle": "1. Personal Data We Collect",
  "dataCollectionIntro": "At Student Assistant, we collect personal data to enhance our services and improve the learning experience. The types of data we collect include:",
  "contactInfo": "Contact Information: such as your name, email address, and telephone number.",
  "accountDetails": "Account Details: username, password (encrypted), and other identifiers.",
  "performanceData": "Performance Data: to personalise learning experiences and adjust challenges.",
  "usageData": "Usage Data: information on how you interact with our services, which helps us tailor content and improve functionality.",
  "dataUseTitle": "2. How We Use Your Data",
  "dataUseIntro": "Your personal data is used to:",
  "dataUseProvide": "Provide, operate, and maintain our services.",
  "dataUseEnhance": "Enhance, personalise, and expand our services.",
  "dataUseUnderstand": "Understand and analyse how you use our services.",
  "dataUseDevelop": "Develop new products, services, features, and functionality.",
  "dataUseCommunicate": "Communicate with you, either directly or through one of our partners, including for customer service, to provide you with updates and other information relating to the website, and for marketing and promotional purposes.",
  "dataUseSend": "Send you emails and other communications that you have opted into.",
  "dataSharingTitle": "3. Data Sharing and Disclosure",
  "dataSharingIntro": "Student Assistant may share your data with:",
  "dataShareServiceProviders": "Service providers who perform services for us and help us operate our business (e.g., hosting, analytics, email delivery, and database management services).",
  "dataShareThirdParties": "Third parties if we believe that disclosure is advisable or necessary to comply with the law, enforce our terms of use, or protect the rights, property, or safety of Student Assistant or others.",
  "dataSharePotentialBuyers": "Potential buyers or other successors in the event of a merger, divestiture, restructuring, reorganisation, dissolution, or other sale or transfer of some or all of Student Assistant's assets.",
  "dataRightsTitle": "4. Data Protection Rights",
  "dataRightsIntro": "Under GDPR, you have the following data protection rights:",
  "rightAccess": "The right to access, update, or delete the information we have on you.",
  "rightRectification": "The right of rectification.",
  "rightObject": "The right to object.",
  "rightRestriction": "The right of restriction.",
  "rightPortability": "The right to data portability",
  "rightWithdraw": "The right to withdraw consent.",
  "dataSecurityTitle": "5. Data Security",
  "dataSecurityContent": "We use appropriate technical and organisational security measures designed to protect the security of any personal information we process. However, please also remember that we cannot guarantee that the internet itself is 100% secure.",
  "policyChangesTitle": "6. Changes to This Policy",
  "policyChangesContent": "We may update our GDPR Compliance Statement from time to time. We will notify you of any changes by posting the new policy on this page.",
  "contactUsTitle": "7. Contact Us",
  "contactUsContent": "If you have any questions about this GDPR Compliance Statement, you can contact us:",
  "contactEmail": "Email: privacy@studentassistant.com",
  "contactAddress": "Mailing Address: Student Assistant, [Insert Address Here].",
  "pageTitle": "Language Choices",
  "headerLC": "Programming Language Choices",
  "intro": "Each programming language has its strengths and is best suited for certain types of projects. Here's a brief overview of some popular programming languages and what they are commonly used for:",
  "pythonDescription": "Python: Best for: Web development, data analysis, artificial intelligence (AI), machine learning (ML), scientific computing, and automation. Strengths: Easy syntax, readability, extensive libraries and frameworks (Django, Flask, Pandas, NumPy, TensorFlow), and a strong community.",
  "javascriptDescription": "JavaScript: Best for: Web development (both front-end and back-end with Node.js), building interactive web applications, and developing desktop and mobile applications (with frameworks like Electron and React Native). Strengths: High compatibility with web browsers, asynchronous programming capabilities, and a vast ecosystem of libraries and frameworks (React, Angular, Vue.js).",
  "javaDescription": "Java: Best for: Enterprise-level backend systems, Android app development, web applications, and large-scale system development. Strengths: Platform independence (write once, run anywhere - WORA), robust standard libraries, strong memory management, and widespread use in large organisations.",
  "csharpDescription": "C#: Best for: Developing Windows applications, game development with Unity, enterprise applications, and mobile apps (via Xamarin). Strengths: Seamless integration with the .NET framework, strong typing, extensive libraries, and good support for parallel programming.",
  "cplusplusDescription": "C++: Best for: System/software development, game development, real-time simulation, high-performance applications, and client-server applications. Strengths: Close to hardware, object-oriented, powerful standard library, and control over system resources.",
  "swiftDescription": "Swift: Best for: iOS and macOS applications, and to a lesser extent, web backend development. Strengths: Safety (designed to eliminate unsafe code), fast performance, and interoperability with Objective-C.",
  "rubyDescription": "Ruby: Best for: Web applications, especially with the Ruby on Rails framework, and scripting. Strengths: Elegant syntax, ease of learning, and a strong focus on developer happiness and productivity.",
  "phpDescription": "PHP: Best for: Server-side web development, content management systems (like WordPress), and dynamic website content. Strengths: Wide range of databases support, integrated with various web development frameworks (Laravel, Symfony), and extensive documentation.",
  "goDescription": "Go (Golang): Best for: Concurrent programming, microservices, cloud-based/web services, and high-performance applications. Strengths: Simple syntax, efficient concurrency model, fast execution, and built-in support for garbage collection.",
  "kotlinDescription": "Kotlin: Best for: Android app development, server-side development, and web frontend development (via Kotlin/JS). Strengths: Interoperable with Java, concise and expressive syntax, and safety features (e.g., null safety).",
  "closing": "Each of these languages has its niche where it shines the brightest. The choice of language often depends on the specific requirements of the project, existing infrastructure, performance considerations, and the development team's expertise.",
  "userLogin": "User Login",

  "navHome": "Home",
  "navTermsPolicies": "Terms and Policies",
  "navFeedback": "Feedback",
  "navAbout": "About",
  "navContact": "Contact",
  "navPractice": "Practice",
  "navLanguageChoice": "Language Choice",
  "navChat": "Chat",
  "navLogin": "Login",
  "navRegister": "Register",
  "navChallenges": "Challenges",
  "navIdiom": "Idiom",
  "navEnglish": "English",
  "navFrench": "French",
  "navPortuguese": "Portuguese",
  "navSpanish": "Spanish"
}
